---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RailingType.BalusterPlacement
source: html/31f4da5f-efd9-8367-0256-9048d04954be.htm
---
# Autodesk.Revit.DB.Architecture.RailingType.BalusterPlacement Property

Accesses the object containing properties related to the baluster placement.

## Syntax (C#)
```csharp
public BalusterPlacement BalusterPlacement { get; }
```